In [1]:
import pandas as pd

In [3]:
# Creating the series of numbers
floodingReports = pd.Series([3,5,6,7,8])
floodingReports

0    3
1    5
2    6
3    7
4    8
dtype: int64

In [8]:
# Setting the index names for series
floodingReports = pd.Series([3,5,6,7,8], index=['Forest County', 'Cheryl County', 'Mandya County','EON County','Bangalore County'])
floodingReports

Forest County       3
Cheryl County       5
Mandya County       6
EON County          7
Bangalore County    8
dtype: int64

In [11]:
#want to access perticuler value using index name
floodingReports['Cheryl County']

5

In [15]:
#creating the series by dictionary
Reports_dic= {'Forest County':35, 'Cheryl County':25, 'Mandya County':75,'EON County':55,'Bangalore County':65}

Reports = pd.Series(Reports_dic)
Reports

Forest County       35
Cheryl County       25
Mandya County       75
EON County          55
Bangalore County    65
dtype: int64

In [18]:
#change the index value
Reports.index=['Forest','Cheryl','Mandya','EON','Bangalore']
Reports

Forest       35
Cheryl       25
Mandya       75
EON          55
Bangalore    65
dtype: int64

In [22]:
# creating the dataframe (table)
data = {'County': ['Forest','Cheryl','Mandya','EON','Bangalore'],
       'year': [2019,2018,2017,2015,2016],
       'values':[35,65,85,95,45]}
df=pd.DataFrame(data)
df

      County  year  values
0     Forest  2019      35
1     Cheryl  2018      65
2     Mandya  2017      85
3        EON  2015      95
4  Bangalore  2016      45

In [24]:
df['whether']=pd.Series([29,32,40,20,19])
df

      County  year  values  whether
0     Forest  2019      35       29
1     Cheryl  2018      65       32
2     Mandya  2017      85       40
3        EON  2015      95       20
4  Bangalore  2016      45       19

In [25]:
del df['whether']

In [26]:
df

      County  year  values
0     Forest  2019      35
1     Cheryl  2018      65
2     Mandya  2017      85
3        EON  2015      95
4  Bangalore  2016      45

In [27]:
# Transpose the table
df.T

             0       1       2     3          4
County  Forest  Cheryl  Mandya   EON  Bangalore
year      2019    2018    2017  2015       2016
values      35      65      85    95         45